src/Enums/ПолитикиУчетаРабочегоВремени/ПолитикиУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолитикиУчетаРабочегоВремени</name>
  <enumValues>
    <name>НеУчитывать</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьЕжедневныеОтчеты</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьЕженедельныеОтчеты</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьЕжедневныеИЕженедельныеОтчеты</name>
  </enumValues>
</mdclass:Enum>

src/Constants/ПолитикаУчетаРабочегоВремени/ValueManagerModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = 
		Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеИЕженедельныеОтчеты Тогда
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Истина);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Истина);
	ИначеЕсли Значение = 
		Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеОтчеты Тогда
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Истина);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Ложь);
	ИначеЕсли Значение = 
		Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕженедельныеОтчеты Тогда
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Ложь);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Истина);
	Иначе
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Ложь);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры
